import { atom } from 'recoil';
export const articlesState = atom({
  key: 'articlesState',
  default: [
    {
      id: 1,
      title: 'Article 1',
      percentage: '81',
      paragraphs: [
        {
          title: 'Paragraph 1',
          content: [
            [
              43,
              [
                ['!_제3조의2(투자신탁의 ', '!/투자자', '!_)'],

                [
                  '__이 투자신탁은',
                  '!_일반 사모집합',
                  '!-투자기구로서',
                  '__가입자격은 다음 각호의 어느 하나에 해당하는 투자자("적격투자자"라 한다)',
                ],
              ],
              45,
              [
                ['!_제3조의 2(투자신탁의 ', '!/가입제한', '!_)'],
                [
                  '_+ Addition Test ',
                  '!_일반 사모집합',
                  '__ 가입자격은 다음 각 호의 어느 하나에 해당하는 투자자("적격투자자"라 한다)',
                ],
              ],
            ],
          ],
        },
        {
          title: 'Paragraph 1',
          content: [
            [
              43,
              [
                ['!_제3조의2(투자신탁의 ', '!/투자자', '!_)'],

                [
                  '__이 투자신탁은',
                  '!_일반 사모집합',
                  '!-투자기구로서',
                  '__가입자격은 다음 각호의 어느 하나에 해당하는 투자자("적격투자자"라 한다)',
                ],
              ],
              45,
              [
                ['!_제3조의 2(투자신탁의 ', '!/가입제한', '!_)'],
                [
                  '_+ Addition Test ',
                  '!_일반 사모집합',
                  '__ 가입자격은 다음 각 호의 어느 하나에 해당하는 투자자("적격투자자"라 한다)',
                ],
              ],
            ],
          ],
        },
        {
          title: 'Paragraph 1',
          content: [
            [
              43,
              [
                ['!_제3조의2(투자신탁의 ', '!/투자자', '!_)'],

                [
                  '__이 투자신탁은',
                  '!_일반 사모집합',
                  '!-투자기구로서',
                  '__가입자격은 다음 각호의 어느 하나에 해당하는 투자자("적격투자자"라 한다)',
                ],
              ],
              45,
              [
                ['!_제3조의 2(투자신탁의 ', '!/가입제한', '!_)'],
                [
                  '_+ Addition Test ',
                  '!_일반 사모집합',
                  '__ 가입자격은 다음 각 호의 어느 하나에 해당하는 투자자("적격투자자"라 한다)',
                ],
              ],
            ],
          ],
        },
        {
          title: 'Paragraph 1',
          content: [
            [
              43,
              [
                ['!_제3조의2(투자신탁의 ', '!/투자자', '!_)'],

                [
                  '__이 투자신탁은',
                  '!_일반 사모집합',
                  '!-투자기구로서',
                  '__가입자격은 다음 각호의 어느 하나에 해당하는 투자자("적격투자자"라 한다)',
                ],
              ],
              45,
              [
                ['!_제3조의 2(투자신탁의 ', '!/가입제한', '!_)'],
                [
                  '_+ Addition Test ',
                  '!_일반 사모집합',
                  '__ 가입자격은 다음 각 호의 어느 하나에 해당하는 투자자("적격투자자"라 한다)',
                ],
              ],
            ],
          ],
        },
        {
          title: 'Paragraph 1',
          content: [
            [
              43,
              [
                ['!_제3조의2(투자신탁의 ', '!/투자자', '!_)'],

                [
                  '__이 투자신탁은',
                  '!_일반 사모집합',
                  '!-투자기구로서',
                  '__가입자격은 다음 각호의 어느 하나에 해당하는 투자자("적격투자자"라 한다)',
                ],
              ],
              45,
              [
                ['!_제3조의 2(투자신탁의 ', '!/가입제한', '!_)'],
                [
                  '_+ Addition Test ',
                  '!_일반 사모집합',
                  '__ 가입자격은 다음 각 호의 어느 하나에 해당하는 투자자("적격투자자"라 한다)',
                ],
              ],
            ],
          ],
        },
        {
          title: 'Paragraph 1',
          content: [
            [
              43,
              [
                ['!_제3조의2(투자신탁의 ', '!/투자자', '!_)'],

                [
                  '__이 투자신탁은',
                  '!_일반 사모집합',
                  '!-투자기구로서',
                  '__가입자격은 다음 각호의 어느 하나에 해당하는 투자자("적격투자자"라 한다)',
                ],
              ],
              45,
              [
                ['!_제3조의 2(투자신탁의 ', '!/가입제한', '!_)'],
                [
                  '_+ Addition Test ',
                  '!_일반 사모집합',
                  '__ 가입자격은 다음 각 호의 어느 하나에 해당하는 투자자("적격투자자"라 한다)',
                ],
              ],
            ],
          ],
        },
        {
          title: 'Paragraph 1',
          content: [
            [
              43,
              [
                ['!_제3조의2(투자신탁의 ', '!/투자자', '!_)'],

                [
                  '__이 투자신탁은',
                  '!_일반 사모집합',
                  '!-투자기구로서',
                  '__가입자격은 다음 각호의 어느 하나에 해당하는 투자자("적격투자자"라 한다)',
                ],
              ],
              45,
              [
                ['!_제3조의 2(투자신탁의 ', '!/가입제한', '!_)'],
                [
                  '_+ Addition Test ',
                  '!_일반 사모집합',
                  '__ 가입자격은 다음 각 호의 어느 하나에 해당하는 투자자("적격투자자"라 한다)',
                ],
              ],
            ],
          ],
        },
      ],
    },
    {
      id: 2,
      title: 'Article 1',
      percentage: '81',
      paragraphs: [
        {
          title: 'Paragraph 1',
          content: [
            [
              43,
              [
                ['!_제3조의2(투자신탁의 ', '!/투자자', '!_)'],

                [
                  '__이 투자신탁은',
                  '!_일반 사모집합',
                  '!-투자기구로서',
                  '__가입자격은 다음 각호의 어느 하나에 해당하는 투자자("적격투자자"라 한다)',
                ],
              ],
              45,
              [
                ['!_제3조의 2(투자신탁의 ', '!/가입제한', '!_)'],
                [
                  '_+ Addition Test ',
                  '!_일반 사모집합',
                  '__ 가입자격은 다음 각 호의 어느 하나에 해당하는 투자자("적격투자자"라 한다)',
                ],
              ],
            ],
          ],
        },
        {
          title: 'Paragraph 1',
          content: [
            [
              43,
              [
                ['!_제3조의2(투자신탁의 ', '!/투자자', '!_)'],

                [
                  '__이 투자신탁은',
                  '!_일반 사모집합',
                  '!-투자기구로서',
                  '__가입자격은 다음 각호의 어느 하나에 해당하는 투자자("적격투자자"라 한다)',
                ],
              ],
              45,
              [
                ['!_제3조의 2(투자신탁의 ', '!/가입제한', '!_)'],
                [
                  '_+ Addition Test ',
                  '!_일반 사모집합',
                  '__ 가입자격은 다음 각 호의 어느 하나에 해당하는 투자자("적격투자자"라 한다)',
                ],
              ],
            ],
          ],
        },
      ],
    },
    {
      id: 3,
      title: 'Article 1',
      percentage: '81',
      paragraphs: [
        {
          title: 'Paragraph 1',
          content: [
            [
              43,
              [
                ['!_제3조의2(투자신탁의 ', '!/투자자', '!_)'],

                [
                  '__이 투자신탁은',
                  '!_일반 사모집합',
                  '!-투자기구로서',
                  '__가입자격은 다음 각호의 어느 하나에 해당하는 투자자("적격투자자"라 한다)',
                ],
              ],
              45,
              [
                ['!_제3조의 2(투자신탁의 ', '!/가입제한', '!_)'],
                [
                  '_+ Addition Test ',
                  '!_일반 사모집합',
                  '__ 가입자격은 다음 각 호의 어느 하나에 해당하는 투자자("적격투자자"라 한다)',
                ],
              ],
            ],
          ],
        },
      ],
    },
  ],
});

export const selectedArticleState = atom({
  key: 'selectedArticleState',
  default: {
    id: 1,
    title: 'Article 1',
    percentage: '81',
    paragraphs: [
      {
        title: 'Paragraph 1',
        content: [
          [
            43,
            [
              ['!_제3조의2(투자신탁의 ', '!/투자자', '!_)'],

              [
                '__이 투자신탁은',
                '!_일반 사모집합',
                '!-투자기구로서',
                '__가입자격은 다음 각호의 어느 하나에 해당하는 투자자("적격투자자"라 한다)',
              ],
            ],
            45,
            [
              ['!_제3조의 2(투자신탁의 ', '!/가입제한', '!_)'],
              [
                '_+ Addition Test ',
                '!_일반 사모집합',
                '__ 가입자격은 다음 각 호의 어느 하나에 해당하는 투자자("적격투자자"라 한다)',
              ],
            ],
          ],
        ],
      },
      {
        title: 'Paragraph 1',
        content: [
          [
            43,
            [
              ['!_제3조의2(투자신탁의 ', '!/투자자', '!_)'],

              [
                '__이 투자신탁은',
                '!_일반 사모집합',
                '!-투자기구로서',
                '__가입자격은 다음 각호의 어느 하나에 해당하는 투자자("적격투자자"라 한다)',
              ],
            ],
            45,
            [
              ['!_제3조의 2(투자신탁의 ', '!/가입제한', '!_)'],
              [
                '_+ Addition Test ',
                '!_일반 사모집합',
                '__ 가입자격은 다음 각 호의 어느 하나에 해당하는 투자자("적격투자자"라 한다)',
              ],
            ],
          ],
        ],
      },
      {
        title: 'Paragraph 1',
        content: [
          [
            43,
            [
              ['!_제3조의2(투자신탁의 ', '!/투자자', '!_)'],

              [
                '__이 투자신탁은',
                '!_일반 사모집합',
                '!-투자기구로서',
                '__가입자격은 다음 각호의 어느 하나에 해당하는 투자자("적격투자자"라 한다)',
              ],
            ],
            45,
            [
              ['!_제3조의 2(투자신탁의 ', '!/가입제한', '!_)'],
              [
                '_+ Addition Test ',
                '!_일반 사모집합',
                '__ 가입자격은 다음 각 호의 어느 하나에 해당하는 투자자("적격투자자"라 한다)',
              ],
            ],
          ],
        ],
      },
      {
        title: 'Paragraph 1',
        content: [
          [
            43,
            [
              ['!_제3조의2(투자신탁의 ', '!/투자자', '!_)'],

              [
                '__이 투자신탁은',
                '!_일반 사모집합',
                '!-투자기구로서',
                '__가입자격은 다음 각호의 어느 하나에 해당하는 투자자("적격투자자"라 한다)',
              ],
            ],
            45,
            [
              ['!_제3조의 2(투자신탁의 ', '!/가입제한', '!_)'],
              [
                '_+ Addition Test ',
                '!_일반 사모집합',
                '__ 가입자격은 다음 각 호의 어느 하나에 해당하는 투자자("적격투자자"라 한다)',
              ],
            ],
          ],
        ],
      },
      {
        title: 'Paragraph 1',
        content: [
          [
            43,
            [
              ['!_제3조의2(투자신탁의 ', '!/투자자', '!_)'],

              [
                '__이 투자신탁은',
                '!_일반 사모집합',
                '!-투자기구로서',
                '__가입자격은 다음 각호의 어느 하나에 해당하는 투자자("적격투자자"라 한다)',
              ],
            ],
            45,
            [
              ['!_제3조의 2(투자신탁의 ', '!/가입제한', '!_)'],
              [
                '_+ Addition Test ',
                '!_일반 사모집합',
                '__ 가입자격은 다음 각 호의 어느 하나에 해당하는 투자자("적격투자자"라 한다)',
              ],
            ],
          ],
        ],
      },
      {
        title: 'Paragraph 1',
        content: [
          [
            43,
            [
              ['!_제3조의2(투자신탁의 ', '!/투자자', '!_)'],

              [
                '__이 투자신탁은',
                '!_일반 사모집합',
                '!-투자기구로서',
                '__가입자격은 다음 각호의 어느 하나에 해당하는 투자자("적격투자자"라 한다)',
              ],
            ],
            45,
            [
              ['!_제3조의 2(투자신탁의 ', '!/가입제한', '!_)'],
              [
                '_+ Addition Test ',
                '!_일반 사모집합',
                '__ 가입자격은 다음 각 호의 어느 하나에 해당하는 투자자("적격투자자"라 한다)',
              ],
            ],
          ],
        ],
      },
      {
        title: 'Paragraph 1',
        content: [
          {
            //this is a chunk
            indexes: [43, 45],
            chunkContent: [
              [
                {
                  id: 1,
                  weight: 'font-bold',
                  content: '!_제3조의2(투자신탁의 ',
                },
                {
                  id: 2,
                  weight: 'font-bold',
                  replaced: '!/투자자',
                  replacement: '!/가입제한',
                },
                {
                  id: 1,
                  weight: 'font-bold',
                  content: '!_) ',
                },
              ],

              [
                {
                  id: 1,
                  weight: '',
                  added: ' Addition Test ',
                },
                {
                  id: 1,
                  weight: '',
                  content: '__이 투자신탁은',
                },
                {
                  id: 1,
                  weight: 'font-bold',
                  content: '!_일반 사모집합',
                },
                {
                  id: 1,
                  weight: '',
                  missing: '!-투자기구로서',
                },
                {
                  id: 1,
                  weight: '',
                  content:
                    '__가입자격은 다음 각호의 어느 하나에 해당하는 투자자("적격투자자"라 한다)',
                },
              ],
            ],
          },
        ],
      },
    ],
  },
});
